Revit 2024 API
IFCFileModelOptions Members
The IFCFileModelOptions type exposes the following members.
Constructors
Name | Description
IFCFileModelOptions
 Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.
Methods
Name | Description
Dispose
Releases all resources used by the IFCFileModelOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CacheSize
 The cache size of the file.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SchemaFile
 The full name of an IFC schema file.
SchemaName
 The name of the schema.
UserControlledInverses
 Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace